In [32]:
import sqlite3

import numpy as np
import pandas as pd

In [33]:
sqlite3.sqlite_version

'3.37.2'

In [34]:
con = sqlite3.connect('../data/db')

In [35]:
df = pd.DataFrame({'id': [1, 2, 3, 4, 5], 'salary': [100, 200, 300, 300, 200]})

In [36]:
df.to_sql('employee', con, index=False, if_exists='replace')

5

In [37]:
def select(sql):
    return pd.read_sql(sql, con)

In [38]:
sql = '''
select * from
(select t.*, dense_rank() over (order by t.salary desc) as rnk from employee t) t
where t.rnk = 2'''

In [39]:
select(sql)

   id  salary  rnk
0   2     200    2
1   5     200    2